# Написать программу, которая будет запрашивать у пользователя
# две строки с помощью инпутов, а затем производить их конкатенацию.


# Запрашиваем первую строку у пользователя
first_string = input("Введите первую строку: ")

# Запрашиваем вторую строку у пользователя
second_string = input("Введите вторую строку: ")

# Выполняем конкатенацию двух строк
concatenated_string = first_string + second_string

# Выводим результат конкатенации
print("Результат конкатенации:", concatenated_string)