# Площадь прямоугольника. Написать программу, которая будет
# запрашивать у пользователя длину и ширину прямоугольника,
# а затем вычислять площадь.


# Запрашиваем длину прямоугольника у пользователя
length = float(input("Введите длину прямоугольника: "))

# Запрашиваем ширину прямоугольника у пользователя
width = float(input("Введите ширину прямоугольника: "))

# Вычисляем площадь прямоугольника
area = length * width

# Выводим результат
print("Площадь прямоугольника:", area)